insert into `sys_role`(`id`,`name`,`code`,`create_time`,`update_time`,`remark`) values
(1,'管理员','admin','2024-12-06','2024-12-06','拥有系统最高权限'),
(2,'普通角色','common','2024-12-06','2024-12-06','普通角色'),
(3,'测试角色','test','2024-12-06','2024-12-06','测试角色');


insert into `sys_role_menu`(`id`,`menu_id`,`role_id`) values
(102,1,1),
(103,2,1),
(104,3,1),
(106,4,1),
(107,5,1),
(108,6,1),
(109,7,1),
(110,8,1),
(111,9,1),
(112,1,2),
(114,2,2),
(115,4,2),
(116,5,2),
(117,6,2),
(118,7,2),
(119,1,3),
(120,2,3),
(121,4,3),
(122,5,3),
(123,6,3),
(124,7,3);

insert  `sys_user_role`(`id`,`role_id`,`user_id`) values
(1,1,1),
(2,2,1),
(3,3,2),
(4,2,3);
