INSERT INTO `road_nodes` (`id`, `province`, `city`, `district`, `node_name`, `longitude`, `latitude`, `description`, `last_update_time`) VALUES
(1, '山东省', '青岛市', '市南区', '山东路与江西路交叉口', 120.387, 36.067, '重要交通节点，靠近商圈', NOW()),
(2, '山东省', '青岛市', '市北区', '辽阳路与吉林路交叉口', 120.367, 36.083, '交通繁忙，早高峰拥堵', NOW()),
(3, '山东省', '青岛市', '四方区', '四方路与北京东路交叉口', 120.364, 36.086, '周边有学校，交通流量较大', NOW()),
(4, '山东省', '青岛市', '城阳区', '永安路与福州路交叉口', 120.421, 36.213, '新开发区域，交通潜力较大', NOW()),
(5, '山东省', '青岛市', '李沧区', '金水路与湖州路交叉口', 120.436, 36.166, '商圈集中，流量较高', NOW()),
(6, '山东省', '青岛市', '市南区', '福建路与香港中路交叉口', 120.385, 36.075, '热门商业区域，流量较大', NOW()),
(7, '山东省', '青岛市', '市南区', '山东路与福州路交叉口', 120.390, 36.070, '靠近学校，早晚高峰流量增加', NOW()),
(8, '山东省', '青岛市', '市南区', '南京路与青岛路交叉口', 120.392, 36.068, '交通干道，交通流量畅通', NOW()),
(9, '山东省', '青岛市', '市南区', '河南路与北京路交叉口', 120.394, 36.072, '靠近商圈，流量较高', NOW()),
(10, '山东省', '青岛市', '市南区', '贵阳路与文化路交叉口', 120.375, 36.078, '重要交通节点，周边商席集中', NOW());
